package com.fenbeitong.openapi.plugin.ecology.v8.standard.constant.reimburse;

import lombok.Getter;

@Getter
@SuppressWarnings("all")
public enum ExpenseSmallTypeEnum {

    /**
     * enum_name | desc                      | type
     * --------- | ------------------------- | ----
     * TYPE_1    | 团队建设_标准       | 1
     * TYPE_2    | 团队建设_非标准    | 2    |
     * TYPE_3    | 员工关怀              | 3
     * TYPE_4    | 集体加班费           | 4
     * TYPE_5    | 意外险                 | 5
     * TYPE_6    | 销售费用_培训费_课程费 | 6
     * TYPE_7    | 销售费用_培训费_餐饮费 | 7
     * TYPE_8    | 销售费用_培训费_住宿费 | 8
     * TYPE_9    | 销售费用_培训费_交通费 | 9
     * TYPE_10   | 管理费用_培训费_课程费 | 10
     * TYPE_11   | 管理费用_培训费_餐饮费 | 11
     * TYPE_12   | 管理费用_培训费_住宿费 | 12
     * TYPE_13   | 管理费用_培训费_交通费 | 13
     * TYPE_14   | 其他                    | 14
     * TYPE_15   | 差旅包干补贴        | 15
     * TYPE_16   | 餐饮费                 | 16
     * TYPE_17   | 接送费                 | 17
     * TYPE_18   | 住宿费                 | 18
     * TYPE_19   | 其他                    | 19
     * TYPE_20   | 样品/试吃             | 20
     * TYPE_21   | 场地费                 | 21
     * TYPE_22   | 物料费                 | 22
     * TYPE_23   | 餐饮费                 | 23
     * TYPE_24   | 住宿费                 | 24
     * TYPE_25   | 交通费                 | 25
     * TYPE_26   | 加盟商会议费-场地费 | 26
     * TYPE_27   | 加盟商会议费-物料费 | 27
     * TYPE_28   | 加盟商会议费-餐饮费 | 28
     * TYPE_29   | 加盟商会议费-住宿费 | 29
     * TYPE_30   | 加盟商会议费-交通费 | 30
     * TYPE_31   | 广告服务费           | 31
     * TYPE_32   | 宣传物料费           | 32
     * TYPE_33   | 代言费                 | 33
     * TYPE_34   | 加盟店补贴           | 34
     * TYPE_35   | 储值补贴              | 35
     * TYPE_36   | 商家活动补贴        | 36
     * TYPE_37   | 招商费用-加盟商介绍提成 | 37
     * TYPE_38   | 招商费用-招商推介费 | 38
     * TYPE_39   | 装修费                 | 39
     * TYPE_40   | 房屋租赁              | 40
     * TYPE_41   | 员工宿舍              | 41
     * TYPE_42   | 物业费                 | 42
     * TYPE_43   | 水电费                 | 43
     * TYPE_44   | 垃圾清理费           | 44
     * TYPE_45   | 咨询服务费           | 45
     * TYPE_46   | 设计费                 | 46
     * TYPE_47   | 审计费                 | 47
     * TYPE_48   | 律师费                 | 48
     * TYPE_49   | 招聘费                 | 49
     * TYPE_50   | 检测费                 | 50
     * TYPE_51   | 商标、产权服务费  | 51
     * TYPE_52   | 诉讼仲裁费           | 52
     * TYPE_53   | 系统运维服务费     | 53
     * TYPE_54   | 技术服务费           | 54
     * TYPE_55   | 佣金                    | 55
     * TYPE_56   | 天猫旗舰店           | 56
     * TYPE_57   | 天猫超市              | 57
     * TYPE_58   | 淘宝特价版           | 58   |
     * TYPE_59   | 天猫供销平台        | 59
     * TYPE_60   | 京东渠道_京东自营旗舰店 | 60
     * TYPE_61   | 京东渠道_京东POP旗舰店 | 61
     * TYPE_62   | 京东渠道_京东超市 | 62
     * TYPE_63   | 多多渠道_拼多多官方旗舰店 | 63
     * TYPE_64   | 多多渠道_拼多多食品旗舰店 | 64
     * TYPE_65   | 多多渠道_多多买菜 | 65
     * TYPE_66   | 新媒体渠道_抖音    | 66
     * TYPE_67   | 新媒体渠道_快手    | 67
     * TYPE_68   | 新媒体渠道_小红书 | 68
     * TYPE_69   | 新媒体渠道_有赞    | 69
     * TYPE_70   | 平台配费_平台手续费 | 70
     * TYPE_71   | 私车公用              | 71
     * TYPE_72   | 燃油费                 | 72
     * TYPE_73   | 维修费                 | 73
     * TYPE_74   | 保养费                 | 74
     * TYPE_75   | 审车费                 | 75
     * TYPE_76   | 上牌费                 | 76
     * TYPE_77   | 保险费                 | 77
     * TYPE_78   | 停车费                 | 78
     * TYPE_79   | 过路费                 | 79
     * TYPE_80   | 其他                    | 80
     * TYPE_81   | 办公用品              | 81
     * TYPE_82   | 邮寄费                 | 82
     * TYPE_83   | 电话费                 | 83
     * TYPE_84   | 网络费                 | 84
     * TYPE_85   | 劳保费                 | 85
     * TYPE_86   | 保洁费                 | 86
     * TYPE_87   | 安保费                 | 87
     * TYPE_88   | 其他                    | 88
     * TYPE_89   | 外部会议费-场地费 | 89
     * TYPE_90   | 外部会议费-物料费 | 90
     * TYPE_91   | 外部会议费-餐饮费 | 91
     * TYPE_92   | 外部会议费-住宿费 | 92
     * TYPE_93   | 外部会议费-交通费 | 93
     * TYPE_94   | 董事会费              | 94
     * TYPE_95   | 其他                    | 95
     **/
    TYPE_1("团队建设_标准", 1),
    TYPE_2("团队建设_非标准", 2),
    TYPE_3("员工关怀", 3),
    TYPE_4("集体加班费", 4),
    TYPE_5("意外险", 5),
    TYPE_6("销售费用_培训费_课程费", 6),
    TYPE_7("销售费用_培训费_餐饮费", 7),
    TYPE_8("销售费用_培训费_住宿费", 8),
    TYPE_9("销售费用_培训费_交通费", 9),
    TYPE_10("管理费用_培训费_课程费", 10),
    TYPE_11("管理费用_培训费_餐饮费", 11),
    TYPE_12("管理费用_培训费_住宿费", 12),
    TYPE_13("管理费用_培训费_交通费", 13),
    TYPE_14("其他", 14),
    TYPE_15("差旅包干补贴", 15),
    TYPE_16("餐饮费", 16),
    TYPE_17("接送费", 17),
    TYPE_18("住宿费", 18),
    TYPE_19("其他", 19),
    TYPE_20("样品/试吃", 20),
    TYPE_21("场地费", 21),
    TYPE_22("物料费", 22),
    TYPE_23("餐饮费", 23),
    TYPE_24("住宿费", 24),
    TYPE_25("交通费", 25),
    TYPE_26("加盟商会议费-场地费", 26),
    TYPE_27("加盟商会议费-物料费", 27),
    TYPE_28("加盟商会议费-餐饮费", 28),
    TYPE_29("加盟商会议费-住宿费", 29),
    TYPE_30("加盟商会议费-交通费", 30),
    TYPE_31("广告服务费", 31),
    TYPE_32("宣传物料费", 32),
    TYPE_33("代言费", 33),
    TYPE_34("加盟店补贴", 34),
    TYPE_35("储值补贴", 35),
    TYPE_36("商家活动补贴", 36),
    TYPE_37("招商费用-加盟商介绍提成", 37),
    TYPE_38("招商费用-招商推介费", 38),
    TYPE_39("装修费", 39),
    TYPE_40("房屋租赁", 40),
    TYPE_41("员工宿舍", 41),
    TYPE_42("物业费", 42),
    TYPE_43("水电费", 43),
    TYPE_44("垃圾清理费", 44),
    TYPE_45("咨询服务费", 45),
    TYPE_46("设计费", 46),
    TYPE_47("审计费", 47),
    TYPE_48("律师费", 48),
    TYPE_49("招聘费", 49),
    TYPE_50("检测费", 50),
    TYPE_51("商标、产权服务费", 51),
    TYPE_52("诉讼仲裁费", 52),
    TYPE_53("系统运维服务费", 53),
    TYPE_54("技术服务费", 54),
    TYPE_55("佣金", 55),
    TYPE_56("天猫旗舰店", 56),
    TYPE_57("天猫超市", 57),
    TYPE_58("淘宝特价版", 58),
    TYPE_59("天猫供销平台", 59),
    TYPE_60("京东渠道_京东自营旗舰店", 60),
    TYPE_61("京东渠道_京东POP旗舰店", 61),
    TYPE_62("京东渠道_京东超市", 62),
    TYPE_63("多多渠道_拼多多官方旗舰店", 63),
    TYPE_64("多多渠道_拼多多食品旗舰店", 64),
    TYPE_65("多多渠道_多多买菜", 65),
    TYPE_66("新媒体渠道_抖音", 66),
    TYPE_67("新媒体渠道_快手", 67),
    TYPE_68("新媒体渠道_小红书", 68),
    TYPE_69("新媒体渠道_有赞", 69),
    TYPE_70("平台配费_平台手续费", 70),
    TYPE_71("私车公用", 71),
    TYPE_72("燃油费", 72),
    TYPE_73("维修费", 73),
    TYPE_74("保养费", 74),
    TYPE_75("审车费", 75),
    TYPE_76("上牌费", 76),
    TYPE_77("保险费", 77),
    TYPE_78("停车费", 78),
    TYPE_79("过路费", 79),
    TYPE_80("其他", 80),
    TYPE_81("办公用品", 81),
    TYPE_82("邮寄费", 82),
    TYPE_83("电话费", 83),
    TYPE_84("网络费", 84),
    TYPE_85("劳保费", 85),
    TYPE_86("保洁费", 86),
    TYPE_87("安保费", 87),
    TYPE_88("其他", 88),
    TYPE_89("外部会议费-场地费", 89),
    TYPE_90("外部会议费-物料费", 90),
    TYPE_91("外部会议费-餐饮费", 91),
    TYPE_92("外部会议费-住宿费", 92),
    TYPE_93("外部会议费-交通费", 93),
    TYPE_94("董事会费", 94), 
    TYPE_95("其他", 95);

    private String desc;
    private Integer type;

    ExpenseSmallTypeEnum(String desc, Integer type) {
        this.desc = desc;
        this.type = type;
    }

    public static ExpenseSmallTypeEnum getType(String desc) {
        for (ExpenseSmallTypeEnum source : values()) {
            if (desc.equals(source.getDesc())) {
                return source;
            }
        }
        return null;
    }
}
